app/Controllers/ClientesController.php

SELECT *
FROM `clientes`
---
    public function index(): string
    {
        $clientes = new ClienteModel();
        $datos['datos'] = $clientes->findAll();